In [1]:
import sys
sys.path.append('./')

from Analyzation_relative import Descriptive_statistics as DS
from Analyzation_relative import Data_process as DP
from Analyzation_relative import Regression as Reg
from Analyzation_relative.Statistical_inference import Normality_test

import matplotlib as mpl
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

import seaborn as sns



#*----------------------------------------------------------------
mpl.rcParams['font.sans-serif'] = ['SimHei'] # *允许显示中文
plt.rcParams['axes.unicode_minus']=False# *允许显示坐标轴负数
#*----------------------------------------------------------------

params = {'legend.fontsize': 7,}

plt.rcParams.update(params)

In [2]:
df = pd.read_csv("data/test_data.csv",encoding = "utf-8")
df.head(1) # 数据标签为      [0, 2, 1, 1, 2, 1, 2, 1, 2, 1]

,rent,bedroom,livingroom,bathroom,area,room,floor_grp,subway,region,heating
0,2730,2,1,1,12,1.0,2.0,1.0,通州,1.0

In [3]:
# DS.Auto_plt(df[['livingroom' , 	'bathroom' , 'heating']] , dataclass = [1 ,1 ,1])

In [3]:
# 人为制造异常值

df.loc[[100 , 105 , 142 , 144] , 'livingroom'] = 10
df.loc[[101 , 105 , 205] , 'bathroom'] = 20
df.loc[[109 , 106 , 187] , 'heating'] = 3

In [14]:
num_outindex , binary_outindex , df_pro = DP.Outlier_TreatAndPlot(df[['rent' , 'livingroom']] ,dataclass = [0 , 1] , binary_treat= 'frequency' , plot = False)

In [15]:
num_outindex , binary_outindex

([142,
  438,
  461,
  496,
  512,
  594,
  630,
  651,
  659,
  685,
  687,
  692,
  702,
  720,
  731,
  737,
  738,
  773,
  790,
  843,
  1151,
  1220,
  1306,
  1314,
  1440,
  1537,
  1615,
  1624,
  1662,
  1686,
  1698,
  1734,
  1781,
  1796,
  1829,
  1849,
  1850,
  1853,
  1868,
  1880,
  1968,
  2118,
  2129,
  2254,
  2276,
  2308,
  2439,
  2441,
  2491,
  2492,
  2493,
  2507,
  2558,
  2656,
  2777,
  2860,
  3005,
  3008,
  3013,
  3132,
  3189,
  3274,
  3336,
  3436,
  3449,
  3470,
  3487,
  3683,
  3702,
  3765,
  3823,
  3847,
  3862,
  3880,
  4190,
  4211,
  4250,
  4304,
  4421,
  4582,
  4713,
  4726,
  4737,
  4820,
  4971,
  4998,
  5004,
  5077,
  5117,
  5118],
 [144, 105, 100])

In [12]:
df_pro.loc[140:150 , :]

     rent  livingroom
140  1780           1
141  3840           1
142  2690           1
143  2500           1
144  2160           1
145  2770           1
146  2760           1
147  2790           1
148  2430           1
149  2830           1
150  2260           1

In [ ]:
DS.Auto_plt(df , [0, 2, 1, 1, 0, 1, 2, 1, 2, 1])

In [51]:


new_df = df[['livingroom' , 'bathroom' , 'bedroom']]
test = new_df.groupby(['livingroom' , 'bathroom' , 'bedroom'])
b = pd.DataFrame(test.size().reset_index())
b.columns=['livingroom' , 'bathroom' , 'bedroom' , 'val']
b

    livingroom  bathroom  bedroom   val
0            1         1        2  1486
1            1         1        3  2331
2            1         1        4  1068
3            1         1        5   111
4            1         2        2     1
5            1         2        3    23
6            1         2        4    50
7            1         2        5    30
8            2         1        3     1
9            2         1        4     8
10           2         1        5     7
11           2         2        2     2
12           2         2        3     4
13           2         2        4     9
14           2         2        5    18

In [53]:
ct_abc = pd.pivot_table(b, values= 'val', index=['livingroom' , 'bathroom'], columns='bedroom',
                        aggfunc=np.sum , margins = True).fillna(0)
ct_abc

bedroom                   2       3       4      5   All
livingroom bathroom
1          1         1486.0  2331.0  1068.0  111.0  4996
           2            1.0    23.0    50.0   30.0   104
2          1            0.0     1.0     8.0    7.0    16
           2            2.0     4.0     9.0   18.0    33
All                  1489.0  2359.0  1135.0  166.0  5149